package ua.com.jobsukraine.entity.enums;

public enum Categories {
	IT(" IT, комп'ютери, Інтернет"), ADMINISTRATION(" Адмiнiстрацiя, керівництво середньої ланки");
	// TODO add categories
	// Бухгалтерія, аудит
	// Готельно-ресторанний бізнес, туризм
	// Дизайн, творчість
	// Краса, фітнес, спорт
	// Культура, музика, шоу-бізнес
	// Логістика, склад, ЗЕД
	// Маркетинг, реклама, PR
	// Медицина, фармацевтика
	// Нерухомість
	// Освіта, наука
	// Охорона, безпека
	// Продаж, закупівля
	// Робочі спеціальності, виробництво
	// Роздрібна торгівля
	// Секретаріат, діловодство, АГВ
	// Сільське господарство, агробізнес
	// ЗМІ, видавництво, поліграфія
	// Страхування
	// Будівництво, архітектура
	// Сфера обслуговування
	// Телекомунікації та зв'язок
	// Топ-менеджмент, керівництво вищої ланки
	// Транспорт, автобізнес
	// Управління персоналом, HR
	// Фінанси, банк
	// Юриспруденція
	// Інші сфери діяльності
	private final String value;

	private Categories(final String s) {
		value = s;
	}

	public String toString() {
		return value;
	}
}
